[
  {
    "id": "senior-fullstack-engineer",
    "title": "Senior Full-Stack Engineer",
    "department": "Engineering",
    "location": "San Francisco, CA / Remote",
    "type": "Full-time",
    "description": "Build the core platform that powers intelligent automation for enterprise operations teams. You'll architect scalable systems, design intuitive APIs, and ship features that handle millions of workflow executions.",
    "requirements": [
      "5+ years of experience with TypeScript, React, and Node.js",
      "Deep understanding of distributed systems and microservices architecture",
      "Experience building and scaling production APIs serving 10k+ requests/second",
      "Strong system design skills with focus on reliability and observability",
      "Track record of shipping high-quality code in fast-paced environments"
    ],
    "responsibilities": [
      "Design and implement core platform features from API to UI",
      "Build robust automation workflows with error handling and retry logic",
      "Collaborate with product and design on feature specifications",
      "Mentor junior engineers through code review and pair programming",
      "Contribute to architectural decisions and technical strategy"
    ],
    "niceToHave": [
      "Experience with AI/ML systems or LLM integration",
      "Background in workflow engines (Temporal, Airflow, Prefect)",
      "Contributions to open-source projects",
      "Previous experience at B2B SaaS companies"
    ]
  },
  {
    "id": "product-designer",
    "title": "Product Designer",
    "department": "Design",
    "location": "New York, NY / Remote",
    "type": "Full-time",
    "description": "Shape the experience for operations teams managing complex automation workflows. You'll design interfaces that balance power and simplicity, conducting user research and iterating based on feedback.",
    "requirements": [
      "4+ years of product design experience, preferably in B2B SaaS",
      "Strong portfolio demonstrating end-to-end design process",
      "Expertise in Figma with component-based design systems",
      "Experience conducting user research and usability testing",
      "Excellent communication skills for cross-functional collaboration"
    ],
    "responsibilities": [
      "Design intuitive workflows for complex automation configurations",
      "Create and maintain design system components and patterns",
      "Conduct user research to validate design decisions",
      "Collaborate with engineering on implementation details",
      "Present design rationale to stakeholders and leadership"
    ],
    "niceToHave": [
      "Experience designing dashboard and analytics interfaces",
      "Knowledge of accessibility standards (WCAG 2.1 AA+)",
      "Familiarity with front-end development (HTML/CSS/JS)",
      "Previous work on developer-facing products"
    ]
  },
  {
    "id": "customer-success-manager",
    "title": "Customer Success Manager",
    "department": "Customer Success",
    "location": "Remote (US)",
    "type": "Full-time",
    "description": "Partner with enterprise customers to design, deploy, and optimize automation strategies that drive measurable business impact. You'll become a trusted advisor, understanding operational challenges and translating them into technical solutions.",
    "requirements": [
      "3+ years in customer success, account management, or solutions consulting",
      "Strong technical aptitude with ability to learn complex software systems",
      "Experience managing enterprise accounts with $100k+ ARR",
      "Excellent communication skills for executive and technical audiences",
      "Data-driven approach to measuring customer health and ROI"
    ],
    "responsibilities": [
      "Own customer relationships from onboarding through renewal",
      "Design automation strategies aligned with business objectives",
      "Conduct quarterly business reviews with customer stakeholders",
      "Identify expansion opportunities and drive upsells",
      "Advocate for customer needs in product roadmap discussions"
    ],
    "niceToHave": [
      "Experience in operations, supply chain, or logistics domains",
      "Background in implementation or professional services",
      "Familiarity with workflow automation or RPA tools",
      "Previous experience selling or supporting B2B SaaS"
    ]
  },
  {
    "id": "devops-engineer",
    "title": "DevOps / Platform Engineer",
    "department": "Engineering",
    "location": "Remote (Global)",
    "type": "Full-time",
    "description": "Build and maintain the infrastructure that powers Artifically's automation platform. You'll own CI/CD pipelines, monitoring systems, and deployment automation while ensuring 99.9% uptime.",
    "requirements": [
      "4+ years of DevOps or platform engineering experience",
      "Expert knowledge of AWS (ECS, RDS, S3, CloudWatch, Lambda)",
      "Strong experience with Infrastructure as Code (Terraform or CloudFormation)",
      "Proficiency with container orchestration (Docker, Kubernetes)",
      "Deep understanding of observability tools (DataDog, Prometheus, Grafana)"
    ],
    "responsibilities": [
      "Design and maintain cloud infrastructure on AWS",
      "Build CI/CD pipelines for rapid, reliable deployments",
      "Implement monitoring, alerting, and incident response systems",
      "Optimize infrastructure costs and performance",
      "Ensure security best practices and compliance requirements"
    ],
    "niceToHave": [
      "Experience with multi-tenant SaaS architecture",
      "Background in security engineering or compliance (SOC 2, ISO 27001)",
      "Familiarity with service mesh technologies (Istio, Linkerd)",
      "Previous experience at high-growth startups"
    ]
  },
  {
    "id": "technical-writer",
    "title": "Technical Writer",
    "department": "Product",
    "location": "Remote (US)",
    "type": "Contract",
    "description": "Create comprehensive documentation that helps developers and operations teams successfully adopt Artifically. You'll write API guides, tutorials, and best practice content.",
    "requirements": [
      "3+ years of technical writing experience for developer audiences",
      "Ability to understand and explain complex technical concepts clearly",
      "Experience documenting APIs, SDKs, or developer platforms",
      "Strong editing skills with attention to detail",
      "Portfolio demonstrating clean, well-structured documentation"
    ],
    "responsibilities": [
      "Write and maintain API reference documentation",
      "Create tutorials and how-to guides for common use cases",
      "Develop best practice content for automation workflows",
      "Collaborate with engineering to document new features",
      "Improve documentation based on user feedback and analytics"
    ],
    "niceToHave": [
      "Experience with documentation platforms (GitBook, ReadMe, Docusaurus)",
      "Technical background or coding experience",
      "Familiarity with Markdown and version control (Git)",
      "Previous experience at developer tools companies"
    ]
  },
  {
    "id": "sales-development-rep",
    "title": "Sales Development Representative",
    "department": "Sales",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "description": "Drive pipeline generation by identifying and qualifying high-value prospects. You'll be the first point of contact for companies exploring automation solutions.",
    "requirements": [
      "1-2 years of SDR experience, preferably in B2B SaaS",
      "Strong communication skills via phone, email, and LinkedIn",
      "Ability to learn and articulate technical value propositions",
      "Self-motivated with consistent track record of hitting quotas",
      "Experience with CRM systems (Salesforce, HubSpot)"
    ],
    "responsibilities": [
      "Generate qualified leads through outbound prospecting",
      "Conduct discovery calls to understand prospect needs",
      "Schedule demos for Account Executives",
      "Maintain accurate records in CRM",
      "Collaborate with marketing on campaign effectiveness"
    ],
    "niceToHave": [
      "Experience selling to operations or IT leaders",
      "Background in supply chain, logistics, or healthcare",
      "Familiarity with automation or AI technologies",
      "Previous experience at Series A-C startups"
    ]
  }
]
